---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemTagBadView
source: html/26b8d4d1-46d9-3c43-f32f-560e250ec932.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemTagBadView Property

Beam System Tags can only be placed in plan , elevation and 3D views.

## Syntax (C#)
```csharp
public static FailureDefinitionId BeamSystemTagBadView { get; }
```